# Filtering and Ordering - Lab

## Introduction
In this lab, you will write more `SELECT` statements to solidify your ability to query a SQL database. You will also write more specific queries using the tools you learned in the previous lesson.

## Objectives
You will be able to:
* Write SQL queries to filter and order results
* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)
* Limit the number of records returned by a query using `LIMIT`
* Filter results using `BETWEEN` and `IS NULL`

### Famous Dogs

Here's a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

First, import sqlite3 and establish a connection to the database **dogs.db**. Then, create a cursor object so that you can pass SQL queries to the database.

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('dogs.db')
cur = conn.cursor()

## Queries

Display the outputs for each of the following query descriptions.

### Select the name and breed for all female dogs

In [4]:
cur.execute("""SELECT name, breed FROM dogs WHERE gender == 'F';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

         name        breed
0  Little Ann    coonhound
1     Pickles    black lab
2      Lassie       collie
3       Snowy  fox terrier

### Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

In [8]:
cur.execute("""SELECT name FROM dogs ORDER BY name;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

         name
0        None
1    Clifford
2      Lassie
3  Little Ann
4     McGruff

### Select any dog that doesn't have a name

In [9]:
cur.execute("""SELECT * FROM dogs WHERE name IS null;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id  name  age gender             breed temperament  hungry
0   9  None    4      M  golden retriever     playful       1

### Select the name and breed of only the hungry dogs and list them from youngest to oldest

In [10]:
cur.execute("""SELECT name, breed FROM dogs WHERE hungry = 1 ORDER BY age;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

       name             breed
0    Snoopy            beagle
1  Clifford           big red
2      None  golden retriever
3    Scooby        great dane
4    Lassie            collie

### Select the oldest dog's name, age, and temperament

In [12]:
cur.execute("""SELECT name, age, temperament FROM dogs ORDER BY age DESC LIMIT 1;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

      name  age  temperament
0  Pickles   13  mischievous

### Select the three youngest dogs

In [13]:
cur.execute("""SELECT * FROM dogs ORDER BY age LIMIT 3;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   id      name  age gender             breed temperament  hungry
0   1    Snoopy    3      M            beagle    friendly       1
1   6  Clifford    4      M           big red      smiley       1
2   9      None    4      M  golden retriever     playful       1

### Select the name and breed of the dogs who are between five and ten years old, ordered from oldest to youngest

In [15]:
cur.execute("""SELECT name, breed FROM dogs WHERE age BETWEEN 5 AND 10 ORDER BY age DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

         name        breed
0     McGruff   bloodhound
1       Snowy  fox terrier
2      Lassie       collie
3      Scooby   great dane
4  Little Ann    coonhound

### Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [16]:
cur.execute("""SELECT name, age, hungry FROM dogs WHERE age BETWEEN 2 AND 7 ORDER BY name;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

         name  age  hungry
0        None    4       1
1    Clifford    4       1
2      Lassie    7       1
3  Little Ann    5       0
4      Scooby    6       1

## Summary

Great work! In this lab you practiced writing more complex SQL statements to not only query specific information but also define the quantity and order of your results.